#Exercise 4: Fix missing values for the Horse Colic dataset
In this exercise, we will be cleaning all missing values for all the numerical variables of the Horse Colic dataset.
The original dataset has been shared by Mary McLeish & Matt Cecile from the University of Guelph: http://archive.ics.uci.edu/ml/datasets/horse+colic

1. Open on a new Colab notebook and import the pandas package

In [0]:
import pandas as pd

2. Assign the link to the dataset to a variable called 'file_url':

In [0]:
file_url = 'https://raw.githubusercontent.com/TrainingByPackt/The-Data-Science-Workshop/master/Chapter11/horse-colic.data'

3. Using the .read_csv() method from the package pandas, load the dataset into a new variable called 'df' and specify the parameters header=None, sep='\s+' and prefix='X':

In [0]:
df = pd.read_csv(file_url, header=None, sep='\s+', prefix='X')

4. Print the first 5 rows of the dataframe using the method .head():

In [4]:
df.head()

  X0  X1       X2     X3   X4  X5 X6  ...   X21 X22 X23    X24 X25 X26 X27
0  2   1   530101  38.50   66  28  3  ...     ?   2   2  11300   0   0   2
1  1   1   534817   39.2   88  20  ?  ...     2   3   2   2208   0   0   2
2  2   1   530334  38.30   40  24  1  ...     ?   1   2      0   0   0   1
3  1   9  5290409  39.10  164  84  4  ...  5.30   2   1   2208   0   0   1
4  2   1   530255  37.30  104  35  ?  ...     ?   2   2   4300   0   0   2

[5 rows x 28 columns]

We can see the authors have used the character '?' for missing values but the package pandas thinks it is a normal value as others. We need to transform them into missing values.

5. Reload the dataset into a pandas dataframe using the method .read_csv() but this time add the parameter na_values='?' for specifying this value needs to be treated as a missing value:

In [0]:
df = pd.read_csv(file_url, header=None, sep='\s+', prefix='X', na_values='?')

6. Print the first 5 rows of the dataframe using the method .head():

In [6]:
df.head()

    X0  X1       X2    X3     X4    X5  ...  X22  X23    X24  X25  X26  X27
0  2.0   1   530101  38.5   66.0  28.0  ...  2.0    2  11300    0    0    2
1  1.0   1   534817  39.2   88.0  20.0  ...  3.0    2   2208    0    0    2
2  2.0   1   530334  38.3   40.0  24.0  ...  1.0    2      0    0    0    1
3  1.0   9  5290409  39.1  164.0  84.0  ...  2.0    1   2208    0    0    1
4  2.0   1   530255  37.3  104.0  35.0  ...  2.0    2   4300    0    0    2

[5 rows x 28 columns]

Now we can see that pandas has converted all values '?' to missing values.

7. Print the data type of each variable using the attribute dtypes:

In [7]:
df.dtypes

X0     float64
X1       int64
X2       int64
X3     float64
X4     float64
X5     float64
X6     float64
X7     float64
X8     float64
X9     float64
X10    float64
X11    float64
X12    float64
X13    float64
X14    float64
X15    float64
X16    float64
X17    float64
X18    float64
X19    float64
X20    float64
X21    float64
X22    float64
X23      int64
X24      int64
X25      int64
X26      int64
X27      int64
dtype: object

8. Print the number of missing values for each column by combining the methods .isna() and .sum():

In [8]:
df.isna().sum()

X0       1
X1       0
X2       0
X3      60
X4      24
X5      58
X6      56
X7      69
X8      47
X9      32
X10     55
X11     44
X12     56
X13    104
X14    106
X15    247
X16    102
X17    118
X18     29
X19     33
X20    165
X21    198
X22      1
X23      0
X24      0
X25      0
X26      0
X27      0
dtype: int64

9. Create a condition mask called 'x0_mask' for finding the missing values in the column 'X0' using the method .isna():

In [0]:
x0_mask = df['X0'].isna()

10. Display the number of missing values for this column using the method .sum() on 'x0_mask':

In [10]:
x0_mask.sum()

1

We got the exact same number of missing values for 'X0' as in step 8.

11. Extract the mean of 'X0' using the method '.median()' and store it in a new variable called x0_median. Print its value:

In [11]:
x0_median = df['X0'].median()
print(x0_median)

1.0

The median value for this column is 1. We will replace all missing values by this value in the column 'X0'.

12. Replace all missing values from the variable 'X0' with its median using the method '.fillna()' with the parameter 'inplace=True':

In [0]:
df['X0'].fillna(x0_median, inplace=True)

13. Print the number of missing values for 'X0' by combining the methods .isna() and .sum():

In [13]:
df['X0'].isna().sum()

0

Perfect! There is no mising value anymore in the variable.

14. Create a for loop that will iterate through all the columns of the dataframe. In the for loop, calculate the median for each of them and save it into a variable called 'col_median', impute missing values with this median value using the method '.fillna()' with the parameter 'inplace=True', print the name of the column and its median value:

In [14]:
for col_name in df.columns:
  col_median = df[col_name].median()
  df[col_name].fillna(col_median, inplace=True)
  print(col_name)
  print(col_median)

X0
1.0
X1
1.0
X2
530305.5
X3
38.2
X4
64.0
X5
24.5
X6
3.0
X7
2.0
X8
3.0
X9
1.0
X10
3.0
X11
3.0
X12
2.0
X13
2.0
X14
1.0
X15
5.0
X16
3.0
X17
4.0
X18
45.0
X19
7.5
X20
2.0
X21
2.25
X22
1.0
X23
1.0
X24
2673.5
X25
0.0
X26
0.0
X27
2.0

15. Print the number of missing values for each column by combining the methods .isna() and .sum():

In [15]:
df.isna().sum()

X0     0
X1     0
X2     0
X3     0
X4     0
X5     0
X6     0
X7     0
X8     0
X9     0
X10    0
X11    0
X12    0
X13    0
X14    0
X15    0
X16    0
X17    0
X18    0
X19    0
X20    0
X21    0
X22    0
X23    0
X24    0
X25    0
X26    0
X27    0
dtype: int64

Well done in completing this exercise! We have successfully fixed the missing values for all the numerical variables using the methods provided by the package pandas: .isna() and .fillna().